CREATE DATABASE  IF NOT EXISTS `audit_db` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `audit_db`;
-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: audit_db
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `auction`
--

DROP TABLE IF EXISTS `auction`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `auction` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL,
  `description` varchar(1000) DEFAULT NULL,
  `price` int NOT NULL,
  `end_price` int DEFAULT NULL,
  `auction_start` datetime NOT NULL,
  `auction_end` datetime DEFAULT NULL,
  `min_step` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `auction`
--

LOCK TABLES `auction` WRITE;
/*!40000 ALTER TABLE `auction` DISABLE KEYS */;
INSERT INTO `auction` VALUES (7,'Ավտոմեքենա KIA OPTIMA 2.5L','Տեխնիկական անձնագրի համարը՝ PB035655, նույնացման համարը՝ KNAFU4A22A5145516, շարժիչի հզորությունը՝ 156 Ձ.ՈՒ. / 115 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում։ Զննման ընթացքում պարզվել է, որ վթարի հետևանքով վնասվել է ավտոմեքենայի առաջնամասը։ Ավերականգնելի վնասված և դոֆորմացված են՝ շարժիչի ծածկոցը, առջևի կայանարարը, աջ անվաթևի կեղտապաշտպանիչը, առջևի աջ և ետևի ձախ կողմի անվաթևերը, ետևի թափարգելը, ջերմափոխանակիչը, օդափոխիչը։ Առջևի լուսատու լապտերը, հակամառախուղային լապտերը, ճաղավանդակը կոտրված են։ Շարժիչը տեղաշարժված է, դիմահար ապակին՝ կոտրված։ Բանալին բացակայում է։',1250000,1263000,'2024-02-27 00:44:53','2024-03-25 00:00:00',12000),(8,'Ավտոմեքենա MERCEDES E250 2.5L','Տեխնիկական անձնագրի համարը՝ PB035655, նույնացման համարը՝ KNAFU4A22A5145516, շարժիչի հզորությունը՝ 156 Ձ.ՈՒ. / 115 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում։ Զննման ընթացքում պարզվել է, որ վթարի հետևանքով վնասվել է ավտոմեքենայի առաջնամասը։ Ավերականգնելի վնասված և դոֆորմացված են՝ շարժիչի ծածկոցը, առջևի կայանարարը, աջ անվաթևի կեղտապաշտպանիչը, առջևի աջ և ետևի ձախ կողմի անվաթևերը, ետևի թափարգելը, ջերմափոխանակիչը, օդափոխիչը։ Առջևի լուսատու լապտերը, հակամառախուղային լապտերը, ճաղավանդակը կոտրված են։ Շարժիչը տեղաշարժված է, դիմահար ապակին՝ կոտրված։ Բանալին բացակայում է։',2550000,2870000,'2024-02-27 00:45:41','2024-03-25 00:00:00',18000),(9,'Ավտոմեքենա MERCEDES G500 5.0L','Տեխնիկական անձնագրի համարը՝ PB035655, նույնացման համարը՝ KNAFU4A22A5145516, շարժիչի հզորությունը՝ 156 Ձ.ՈՒ. / 115 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում։ Զննման ընթացքում պարզվել է, որ վթարի հետևանքով վնասվել է ավտոմեքենայի առաջնամասը։ Ավերականգնելի վնասված և դոֆորմացված են՝ շարժիչի ծածկոցը, առջևի կայանարարը, աջ անվաթևի կեղտապաշտպանիչը, առջևի աջ և ետևի ձախ կողմի անվաթևերը, ետևի թափարգելը, ջերմափոխանակիչը, օդափոխիչը։ Առջևի լուսատու լապտերը, հակամառախուղային լապտերը, ճաղավանդակը կոտրված են։ Շարժիչը տեղաշարժված է, դիմահար ապակին՝ կոտրված։ Բանալին բացակայում է։',18000000,18053000,'2024-02-27 00:46:13','2024-03-25 00:00:00',25000),(10,'Ավտոմեքենա OPEL Astra G  1.6L','Տեխնիկական անձնագրի համարը՝ PB035655, նույնացման համարը՝ KNAFU4A22A5145516, շարժիչի հզորությունը՝ 156 Ձ.ՈՒ. / 115 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում։ Զննման ընթացքում պարզվել է, որ վթարի հետևանքով վնասվել է ավտոմեքենայի առաջնամասը։ Ավերականգնելի վնասված և դոֆորմացված են՝ շարժիչի ծածկոցը, առջևի կայանարարը, աջ անվաթևի կեղտապաշտպանիչը, առջևի աջ և ետևի ձախ կողմի անվաթևերը, ետևի թափարգելը, ջերմափոխանակիչը, օդափոխիչը։ Առջևի լուսատու լապտերը, հակամառախուղային լապտերը, ճաղավանդակը կոտրված են։ Շարժիչը տեղաշարժված է, դիմահար ապակին՝ կոտրված։ Բանալին բացակայում է։',850000,865000,'2024-02-27 00:46:46','2024-03-25 00:00:00',5000),(11,'Ավտոմեքենա 3 SERIES  3.0L','Տեխնիկական անձնագրի համարը՝ PB035655, նույնացման համարը՝ KNAFU4A22A5145516, շարժիչի հզորությունը՝ 156 Ձ.ՈՒ. / 115 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում։ Զննման ընթացքում պարզվել է, որ վթարի հետևանքով վնասվել է ավտոմեքենայի առաջնամասը։ Ավերականգնելի վնասված և դոֆորմացված են՝ շարժիչի ծածկոցը, առջևի կայանարարը, աջ անվաթևի կեղտապաշտպանիչը, առջևի աջ և ետևի ձախ կողմի անվաթևերը, ետևի թափարգելը, ջերմափոխանակիչը, օդափոխիչը։ Առջևի լուսատու լապտերը, հակամառախուղային լապտերը, ճաղավանդակը կոտրված են։ Շարժիչը տեղաշարժված է, դիմահար ապակին՝ կոտրված։ Բանալին բացակայում է։',2850000,2920000,'2024-02-27 00:47:11','2024-03-25 00:00:00',15000),(12,'ԱՎՏՈՄԵՔԵՆԱ NISSAN ALTIMA 1.8','Տեխնիկական անձնագրի համարը՝ SB072377, նույնացման համարը՝ 1N4AL21D38C249577, շարժիչի հզորությունը՝ 188 Ձ.ՈՒ. / 138 ԿՎՏ։ Տրանսպորտային միջոցը տեղազնվել է ակնադիտական եղանակով: Տեղազննության օրվա դրությամբ շարժիչը չի գործադրվել մարտկոցի անսարքության պատճառով։ Թափքի վրա առկա են խազված, քերծված, ներկածածկույթը թափված տեղեր։ Հակամառախուղային լապտերը բացակայում են։ Անվադողերը նորմալ վիճակ, սրահը՝ բավարար։',1212965,NULL,'2024-03-14 08:00:00','2024-03-29 09:15:00',5800),(13,'ԱՎՏՈՄԵՔԵՆԱ MITSUBISHI LANCER 1.6 C','Տեխնիկական անձնագրի համարը՝ KB858811, նույնացման համարը՝ JMBSNCB4ARU506509, շարժիչի հզորությունը՝ 112 Ձ.ՈՒ. / 82 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում: Տրանսպորտային միջոցը տեղազնվել է ակնադիտական եղանակով: Տեղազննության օրվա դրությամբ շարժիչը չի գործադրվել մարտկոցի անսարքության պատճառով։ Թափքի վրա առկա են խազված, քերծված, ներկածածկույթը թափված տեղեր։ Հակամառախուղային լապտերը բացակայում են։ Անվադողերը նորմալ վիճակ, սրահը՝ բավարար։',1000965,NULL,'2024-03-14 08:00:00','2024-03-24 19:15:00',7500),(14,'ԱՎՏՈՄԵՔԵՆԱ SKODA FABIA 1.2','Տեխնիկական անձնագրի համարը՝ KB858811, նույնացման համարը՝ JMBSNCB4ARU506509, շարժիչի հզորությունը՝ 112 Ձ.ՈՒ. / 82 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում: Տրանսպորտային միջոցը տեղազնվել է ակնադիտական եղանակով: Տեղազննության օրվա դրությամբ շարժիչը չի գործադրվել մարտկոցի անսարքության պատճառով։ Թափքի վրա առկա են խազված, քերծված, ներկածածկույթը թափված տեղեր։ Հակամառախուղային լապտերը բացակայում են։ Անվադողերը նորմալ վիճակ, սրահը՝ բավարար։',1500000,NULL,'2024-03-14 08:00:00','2024-03-24 19:15:00',8000),(15,'ԱՎՏՈՄԵՔԵՆԱ FORD COURIER 1.8 D','Տեխնիկական անձնագրի համարը՝ KB858811, նույնացման համարը՝ JMBSNCB4ARU506509, շարժիչի հզորությունը՝ 112 Ձ.ՈՒ. / 82 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում: Տրանսպորտային միջոցը տեղազնվել է ակնադիտական եղանակով: Տեղազննության օրվա դրությամբ շարժիչը չի գործադրվել մարտկոցի անսարքության պատճառով։ Թափքի վրա առկա են խազված, քերծված, ներկածածկույթը թափված տեղեր։ Հակամառախուղային լապտերը բացակայում են։ Անվադողերը նորմալ վիճակ, սրահը՝ բավարար։',1250000,NULL,'2024-03-14 08:00:00','2024-03-24 19:15:00',8000),(16,'ԱՎՏՈՄԵՔԵՆԱ VAZ 21074-120-21.','Տեխնիկական անձնագրի համարը՝ KB858811, նույնացման համարը՝ JMBSNCB4ARU506509, շարժիչի հզորությունը՝ 112 Ձ.ՈՒ. / 82 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում: Տրանսպորտային միջոցը տեղազնվել է ակնադիտական եղանակով: Տեղազննության օրվա դրությամբ շարժիչը չի գործադրվել մարտկոցի անսարքության պատճառով։ Թափքի վրա առկա են խազված, քերծված, ներկածածկույթը թափված տեղեր։ Հակամառախուղային լապտերը բացակայում են։ Անվադողերը նորմալ վիճակ, սրահը՝ բավարար։',450000,NULL,'2024-03-14 08:00:00','2024-03-24 19:15:00',2000),(17,'ԱՎՏՈՄԵՔԵՆԱ VAZ 21214.','Տեխնիկական անձնագրի համարը՝ KB858811, նույնացման համարը՝ JMBSNCB4ARU506509, շարժիչի հզորությունը՝ 112 Ձ.ՈՒ. / 82 ԿՎՏ։ Ավտոմեքենան գտնվում է վթարված վիճակում: Տրանսպորտային միջոցը տեղազնվել է ակնադիտական եղանակով: Տեղազննության օրվա դրությամբ շարժիչը չի գործադրվել մարտկոցի անսարքության պատճառով։ Թափքի վրա առկա են խազված, քերծված, ներկածածկույթը թափված տեղեր։ Հակամառախուղային լապտերը բացակայում են։ Անվադողերը նորմալ վիճակ, սրահը՝ բավարար։',450000,NULL,'2024-03-14 08:00:00','2024-03-24 19:15:00',2000);
/*!40000 ALTER TABLE `auction` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `auction_cart`
--

DROP TABLE IF EXISTS `auction_cart`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `auction_cart` (
  `id` int NOT NULL AUTO_INCREMENT,
  `auction_id` int DEFAULT NULL,
  `user_id` int DEFAULT NULL,
  `price` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `auction_id` (`auction_id`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `auction_cart_ibfk_1` FOREIGN KEY (`auction_id`) REFERENCES `auction` (`id`),
  CONSTRAINT `auction_cart_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `auction_cart`
--

LOCK TABLES `auction_cart` WRITE;
/*!40000 ALTER TABLE `auction_cart` DISABLE KEYS */;
INSERT INTO `auction_cart` VALUES (1,9,2,18025000),(2,8,2,2830000),(3,8,2,2849000),(4,7,2,1263000),(5,8,2,2870000),(6,9,2,18053000);
/*!40000 ALTER TABLE `auction_cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(80) NOT NULL,
  `password` varchar(80) NOT NULL,
  `registration_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'arman2013','12345678','2024-02-02 20:45:29'),(2,'admin','qwertyuiop','2024-02-02 20:49:09'),(3,'petros2024','11111111','2024-02-02 20:50:26');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-03-14 21:26:49
